{
  "time": 1616594217328,
  "blocks": [
    {
      "type": "paragraph",
      "data": {
        "text": "<b>Term of Office:<br></b>Alhaji Ahmadu Abubakar was appointed to the board of First Registrars &amp; Investor Services Limited as Chairman in 2013."
      }
    },
    {
      "type": "paragraph",
      "data": {
        "text": "<b>Other Directorships and Office:<br></b>He is on the board of several Nigerian companies notable among which are General Metal Products, Union Bank Plc, Niger Flour and Feed Mill Ltd, Mahab International Ltd among many others."
      }
    },
    {
      "type": "paragraph",
      "data": {
        "text": "<b>Skills and Experience:<br></b>Alhaji Abubakar is an alumni of the prestigious Kings College Lagos, Barewa College and Ahmadu Bello University, Zaria. He has attended various professional short courses/workshops and seminars on Banking and Finance both within and outside Nigeria notable among which are; An intensive course in Banking and Finance in the USA organized by the World Bank and City Bank of America; A course in Finance, Policy and Project Planning and Analysis in India organized by the World Bank and the Industrial Development Bank of India."
      }
    },
    {
      "type": "paragraph",
      "data": {
        "text": "Alhaji Abubakar has several years of public sector management experience and served on several committees both within and outside Nigeria."
      }
    },
    {
      "type": "paragraph",
      "data": {
        "text": "Alhaji started his career with the Ministry of Agriculture, Northern Region in 1964 from where he rose to the position of Chief Produce Officer with the Niger State Government. He has held several management positions with several government establishments notable among which are Executive Secretary, National Population Commission; Assistant Director, Federal Ministry of Finance; Director on the Board of The Nigerian Deposit Insurance Corporation; Chairman, Nigerian Security and Printing Company; Director General, Federal Ministry of Finance; Adviser to the President of the Federal Republic of Nigeria on Finance and Economic Matters (June, 1992-January, 1993)."
      }
    },
    {
      "type": "paragraph",
      "data": {
        "text": "He has also represented Nigeria on several committees abroad among which are; Governor For Nigeria, OPEC Fund Governing Board, Vienna, Austria; Governor for Nigeria UNDP, New York; Governor for Nigeria, IMF/World Bank Board of Governors, Washington DC; Governor for Nigeria, African Development Bank(ADB); Member, representing Nigeria at the OPEC Fund Ministerial Council among many others.<br>In recognition of his contributions to the Economic Development of Nigeria, Alhaji Abubakar was awarded an Honorary degree of Doctor of the University of Clement, London in October 2004 and admitted as a Doctoral member of the Instititute of Professional Financial Managers (IPFM) in October of the same year.<br>Since his retirement from active public service, Alhaji has ventured into Property Development, Financial Consultancy, Computer Services and Farming."
      }
    }
  ],
  "version": "2.19.3"
}