{
    "time" : 1616594885616,
    "blocks" : [
        {
            "type" : "paragraph",
            "data" : {
                "text" : "Bayo Olugbemi is the Managing Director/CEO of First Registrars &amp; Investor Services Ltd (Formerly a Subsidiary of First Bank PLC), a position he has held for 20 years now. He has extensive experience spanning about 38 years in the areas of Investment Banking, Portfolio Management, Share Data Management, Securities Depository, Stockbroking as well as Mutual &amp; Pension Fund Administration. He is a turnaround specialist and has led several initiatives that positively impacted the Share Registration Industry in particular and the Nigerian Capital Market in general. Over the past 38 years, Bayo had worked at different levels in Union Bank of Nigeria Plc, Rims Merchant Bank Ltd, United Securities Ltd, Diamond Bank Plc (now part of Access Bank Plc) and NAL Merchant Bank Plc (Now Part of Sterling Bank Plc) before joining the First Bank Group in January 2000."
            }
        },
        {
            "type" : "paragraph",
            "data" : {
                "text" : "Bayo has served and still serving on several committees of Central Bank Of Nigeria, Securities &amp; Exchange Commission, The Nigerian Stock Exchange, Institute of Directors- Nigeria, CIBN, ICSAN, ICMR etc. He is on the Governing Councils of The Institute of Capital Market Registrars as the Immediate Past President/Chairman of Council, The Chartered Institute of Bankers of Nigeria as 1st Vice President &amp; President-Elect. He is a Past Treasurer of Lagos Chamber Of Commerce &amp; Industry and still serving on the Council. He was a two term Chairman of CIBN, Lagos State Branch and has also served as The National Treasurer and 2nd Vice President Of CIBN respectively."
            }
        },
        {
            "type" : "paragraph",
            "data" : {
                "text" : "Bayo is a Past President Of Jericho Businessmen Club (A Club Of Ibadan Businessmen &amp; Professionals) and currently on the Boards of many forward-looking Companies and NGOs such as Central Securities Clearing Systems Plc, Apt Pension Fund Managers Ltd, Oluyole Global Resources PLC, AWABIKE Technology Ltd, Attwool Group of Schools, Youth Rescue &amp; Care Initiatives (YORCI), Olufunke Kikelomo Olugbemi Cancer Foundation (OKOCAF), Bayo Olugbemi Education Foundation (BOEF), just to mention a few."
            }
        },
        {
            "type" : "paragraph",
            "data" : {
                "text" : "He is a fellow of many professional bodies such&nbsp;as&nbsp;The Chartered Institute of Bankers of Nigeria (CIBN), Institute of Capital Market Registrars (ICMR), National&nbsp;Institute&nbsp;of&nbsp;Marketing of Nigeria (NIMN), Certified Institute of Pensions of&nbsp;Nigeria (CIPN), Institute of Directors (IoD), the Chartered Institute of Taxation of Nigeria (CITN), Nigerian Institute Of Training &amp; Development (NITAD) and Association Of Enterprise Risk Management Professionals (AERMP). He is also an Associate member of Institute of Chartered Secretaries &amp; Administrators Of Nigeria (ICSAN), Chartered Institute of Stockbrokers of Nigeria (CIS), Nigerian Institute of Management (NIM- Chartered) among many others."
            }
        },
        {
            "type" : "paragraph",
            "data" : {
                "text" : "He holds a BSc Degree in Accounting(Unilag), MBA from Lagos State University and MSc in &nbsp;Corporate Governance from Leeds Beckett University, United Kingdom. He has been privileged to attend Management Training Programs in some of the Best Business Schools in the world; Harvard, Stanford, Wharton, IMD, INSEAD, New York Institute Of Finance, Institute of Directors, UK and Lagos Business School."
            }
        },
        {
            "type" : "paragraph",
            "data" : {
                "text" : "He is an author of 3 published books: ADVANCING THROUGH ADVERSITY; ECONOMIC &amp; FINANCIAL STEWARDSHIP and WHEN TOMORROW COMES. He is a trainer in Leadership, Management, Corporate Governance &amp; Ethics, Banking &amp; Finance, Business Formation, Capital Market Development, Stockbroking and Share Registration. He is also a Motivational/Inspirational Speaker of high repute."
            }
        },
        {
            "type" : "paragraph",
            "data" : {
                "text" : "Pastor Olugbemi is a Post Graduate Diploma holder of The Redeemed Christian Bible College, The Redeemed School of Disciples, an Executive Diploma certificate holder of The Redeemed School Of Mission. He was the Pioneer Chairman/Head of RCCG National Steering Committee on Christian Social Responsibility, CSR. He currently serves as Chairman, RCCG African Missions Global, West African Chapter, Vice Chairman, Nigerian Chapter, Pastor In Charge of RCCG Lagos Province 21 &amp; Senior Pastor of Victory Chapel, Magodo."
            }
        },
        {
            "type" : "paragraph",
            "data" : {
                "text" : "He is married with Children."
            }
        }
    ],
    "version" : "2.19.3"
}