{
  "time": 1616597705582,
  "blocks": [
    {
      "type": "paragraph",
      "data": {
        "text": "I hold a Bachelor’s degree in Accounting and Finance, which I obtained in 1986, from Nottingham Trent University, UK.  I got an MSc in Finance in 1995, from the University of Lagos, Akoka.  I am a Stockbroker and a Licensed Dealing member of the Nigerian Stock Exchange.  I have over 30 years’ post - graduation working experience in the Banking and Finance industry; where I rose the position of Deputy Managing Director."
      }
    },
    {
      "type": "paragraph",
      "data": {
        "text": "I started my working career with the Continental (formerly, Chase) Merchant Bank; where I worked in Financial Controls and later, as a Credit Analyst.  I subsequently joined New Africa Merchant Bank Limited as a Credit and Marketing officer and later, headed the Corporate Finance Department of the Bank.  As Head of Corporate Finance I led the team that handled the successful privatization of First Bank PLC, by the Federal Government; as the sole Issuing House. Some of the other Mandates won by the team include privatization of Onigbolo Cement Co. (Republic of Benin) and a Rights Issue for Unipetrol Nigeria PLC; both as Joint Issuing House."
      }
    },
    {
      "type": "paragraph",
      "data": {
        "text": "While in New Africa Merchant Bank, I was seconded to head Newdevco Finance Services Co. Limited; as General Manager / Chief Executive.  Newdevco was a stockbroking / Finance House, jointly owned by the New Nigeria Development Company (NNDC) and New Africa Merchant Bank."
      }
    },
    {
      "type": "paragraph",
      "data": {
        "text": "My commercial banking career started in 1995, with United Bank for Africa PLC. During my 14 years stay in UBA, I garnered a lot of experience in Corporate, Commercial, Consumer and Public Sector Banking; rising to become General Manager / Regional Bank Head – North West Bank."
      }
    },
    {
      "type": "paragraph",
      "data": {
        "text": "In 2009, the Central Bank of Nigeria appointed me as part of the Executive team mandated to stabilize and turn around Oceanic Bank International Nigeria PLC. This mandate was successfully executed, with acquisition and integration of the Bank to Ecobank Nigeria Limited, where I emerged as the Executive Director in charge of Public Sector."
      }
    },
    {
      "type": "paragraph",
      "data": {
        "text": "In March 2012, I was invited by the Board of Fidelity Bank PLC, to join their team, as Executive Director FCT & North Directorate, in charge of the Bank’s business in the FCT and North.  After briefly acting as the Banks Managing Director, I was elevated to the position of Deputy Managing Director in 2016; a position I held until I retired in December 2019."
      }
    }
  ],
  "version": "2.19.3"
}