{
    "time" : 1616597705582,
    "blocks" : [
        {
            "type" : "paragraph",
            "data" : {
                "text" : "<b>Term of Office:<br></b>Foluke Oyeleye was appointed to the board of First Registrars &amp; Investor Services Limited as a Non Executive Director in 2013."
            }
        },
        {
            "type" : "paragraph",
            "data" : {
                "text" : "<b>Skills and Experience:<br></b>Foluke Oyeleye is a qualified Chartered Stockbroker and a member of the Nigerian Institute of Chartered Stockbrokers. She holds a Bachelors Degree in Combined Social Sciences from St Mary’s College, University of Durham, England and a Masters Degree in Business Administration from Harvard Business School, USA."
            }
        },
        {
            "type" : "paragraph",
            "data" : {
                "text" : "She has about two decades work experience in the oil and gas, banking and telecommunications industries. She worked in the procurement and contracts department of Esso Exploration &amp; Production Nigeria Limited (now ExxonMobil). At FCMB Capital Markets, she worked on a number of large, high-profile corporate finance transactions. In addition to other transactions, she managed and coordinated the first three successful privatisation transactions in the Nigerian Privatisation Programme."
            }
        },
        {
            "type" : "paragraph",
            "data" : {
                "text" : "Foluke left FCMB and was one of the co-founders of Econet Wireless Nigeria Limited (now Airtel), the first GSM Company to roll-out in August 2001 and the first to reach 500,000 subscribers. At Econet, Foluke was the National Manager – Retail. She developed the national rollout and marketing strategy for the retail outlets. In 2004, Foluke left Econet for the Harvard Business School, USA. At Harvard, she co-wrote a case “Chief Timothy Adeola Odutola and Nigeria’s Manufacturing Sector” and was elected Co-President of the African Business Club."
            }
        },
        {
            "type" : "paragraph",
            "data" : {
                "text" : "She joined Telecgsm Nigeria Limited in September 2006 as Executive Director. At Telecgsm, she managed operations of the leading distributor and retailer of mobile phones and accessories in Nigeria. She also developed and implemented new strategies for the business to achieve the company’s objectives in the areas of wholesale, operator and retail distribution; market share; generation of revenue; product availability and after sales service."
            }
        }
    ],
    "version" : "2.19.3"
}